const feedback = [
  {
    id: 4,
    img: 'assets/img/icon/testi-ava-07.png',
    name: 'Олександр Редько',
    des: (
      <>
        Самочувствие супер. Колено не тревожит вообще. Спина намного лучше, уже нeту болей и сплю хорошо. Я очень доволен
        что к вам попал, спасибо огромное что помогли мне!!! Я всем буду рекомендовать )))))
      </>
    ),
  },
  {
    id: 2,
    img: 'assets/img/icon/testi-ava-02.jpg',
    name: 'Андрей Харченко',
    des: (
      <>
        Интересный подход, запись на прийом даже в выходной день! отличные отзывы пациентов, и мне знакомый лично
        посоветовал!
      </>
    ),
  },
  {
    id: 6,
    img: 'assets/img/icon/testi-ava-07.png',
    name: 'Оксана',
    des: (
      <>
        Лікарі дуже професійні і з величезним багажем знання та досвіду. Після першого прийому одразу відчувається
        значне полегшення! Дуже рекомендую
      </>
    ),
  },
  {
    id: 7,
    img: 'assets/img/icon/testi-ava-07.png',
    name: 'Вікторія Загородня',
    des: (
      <>
        Спасибо Руху без обмежень за лечение и вытяжку позвоночника, доктор с опытом и очень важно, что есть
        индивидуальный подход, а не по шаблону, а совсем недавно с помощью друзей вылазила с машини. Рекомендую
        невролога этого центра !
      </>
    ),
  },
  {
    id: 1,
    img: 'assets/img/icon/testi-ava-01.jpg',
    name: 'Юлія Маляр',
    des: (
      <>
        Хочу щиро порадити дуже гарний колектив лікарів-ортопедів, реабілітологів. Клініка працює як і до війни. Просто
        нагадую,що краще йти до лікарів планово,а не тоді коли вже йти не можеш. Я сюди ходжу на лікувальний масаж,
        дитина на лікувальну гімнастику, а чоловік на уколи плазми в суглоби.
      </>
    ),
  },
  {
    id: 5,
    img: 'assets/img/icon/testi-ava-07.png',
    name: 'Люба Олизько ',
    des: (
      <>
        Проходили з чоловіком курси лікування в цьому медичному центрі. Вдячні лікарю Сергію Петровичу і медсестрі
        Оксані Олександрівні за професіоналізм і чуйне ставлення до нас. Ми залишились задоволені покращенням нашого
        фізичного стану, при необхідності будемо звертатися тільки сюди. Усім у кого проблеми з опорно-рухового апарату
        рекомендуємо звертатися в клініку Рух без обмежень.
      </>
    ),
  },

  {
    id: 3,
    img: 'assets/img/icon/testi-ava-03.jpg',
    name: 'Леонид Березницкий',
    des: (
      <>
        Була у мене проблема із плечем, на протязі 2 років страждав поки не пішло загострення. Традиційний травматолог
        із Добробуту лікував фіз процедурами, пігулками та мазями. Але позитивний ефект такого лікування закінчився
        відразу після закінчення курсу прийому цих пігулок та фізпроцедур і все стало як було. Одні знайомі порадили
        звернутися до цієї клініки, бо їм та їх численним друзям там вже допомогли і вони задоволені. Виявляється плече
        просто треба було вправити. Дякую лікарю. Всім раджу
      </>
    ),
  },
];

export default feedback;
